In [1]:
import warnings 
warnings.filterwarnings('ignore')

import pandas as pd 
df_train = pd.read_csv('titanic_train.csv')
df_test = pd.read_csv('titanic_test.csv')

In [2]:
print('Training dataset shape : ',df_train.shape)
print('Test dataset shape : ',df_test.shape)

Training dataset shape :  (891, 12)
Test dataset shape :  (418, 11)

In [3]:
print(df_train.head(2))
print(df_test.head(2))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1

   Parch     Ticket     Fare Cabin Embarked
0      0  A/5 21171   7.2500   NaN        S
1      0   PC 17599  71.2833   C85        C
   PassengerId  Pclass                              Name     Sex   Age  SibSp  \
0          892       3                  Kelly, Mr. James    male  34.5      0
1          893       3  Wilkes, Mrs. James (Ellen Needs)  female  47.0      1

   Parch  Ticket    Fare Cabin Embarked
0      0  330911  7.8292   NaN        Q
1      0  363272  7.0000   NaN        S

In [4]:
df_tit = df_train.drop('Survived',axis=1)

In [5]:
df_tit = df_tit.append(df_test, ignore_index=True)

In [6]:
print('df_tit dataset shape : ',df_tit.shape)
print()
print(df_tit.head(2))

df_tit dataset shape :  (1309, 11)

   PassengerId  Pclass                                               Name  \
0            1       3                            Braund, Mr. Owen Harris
1            2       1  Cumings, Mrs. John Bradley (Florence Briggs Th...

      Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1  female  38.0      1      0   PC 17599  71.2833   C85        C

In [7]:
x = df_tit.drop(['PassengerId','Ticket','Fare','Embarked','Cabin'],axis='columns')
print('Shape of x:',x.shape)

Shape of x: (1309, 6)

In [8]:
mean_value = x['Age'].mean()
x['Age']=x['Age'].fillna(mean_value)
print ('Null values in Age is : ',x['Age'].isnull().sum())

Null values in Age is :  0

In [9]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x.Age=sc.fit_transform(x[['Age']])
display (x[:5])

,Pclass,Name,Sex,Age,SibSp,Parch
0,3,"Braund, Mr. Owen Harris",male,-0.611972,1,0
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,0.630431,1,0
2,3,"Heikkinen, Miss. Laina",female,-0.301371,0,0
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,0.397481,1,0
4,3,"Allen, Mr. William Henry",male,0.397481,0,0

In [10]:
x['title']=x.Name.str.split().str[1].str.split('.').str[0]
x.head()

,Pclass,Name,Sex,Age,SibSp,Parch,title
0,3,"Braund, Mr. Owen Harris",male,-0.611972,1,0,Mr
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,0.630431,1,0,Mrs
2,3,"Heikkinen, Miss. Laina",female,-0.301371,0,0,Miss
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,0.397481,1,0,Mrs
4,3,"Allen, Mr. William Henry",male,0.397481,0,0,Mr

In [11]:
x.title.value_counts()

Mr              736
Miss            256
Mrs             191
Master           59
Dr                8
y                 8
Rev               8
Planke,           4
Col               4
Billiard,         3
Impe,             3
Gordon,           2
Carlo,            2
Mlle              2
Ms                2
Major             2
Messemaeker,      2
Cruyssen,         1
Palmquist,        1
Mulder,           1
Mme               1
Brito,            1
Capt              1
Khalil,           1
Velde,            1
Don               1
Walle,            1
the               1
Pelsmaeker,       1
Melkebeke,        1
Steen,            1
der               1
Shawah,           1
Jonkheer          1
Name: title, dtype: int64

In [12]:
x=x.replace(to_replace =['Dr','Capt','Major','Col'],value ="officers")

In [13]:
x=x.replace(to_replace=['Carlo,','Khalil,','Brito,','Palmquist,','Melkebeke,','Billiard,','Jonkheer','the','der','Ms','Cruyssen,','Mme','Steen,','Shawah,','Velde,','Walle,','Don','Pelsmaeker,','Messemaeker,','Mulder,','Gordon,','Mlle','Planke,','Impe,','y','Rev'],value='Special')
x.title.value_counts()

Mr          736
Miss        256
Mrs         191
Master       59
Special      52
officers     15
Name: title, dtype: int64

In [14]:
x = x.join(pd.get_dummies(x.title, prefix ='title'))

In [15]:
x=x.drop(['Name','title','title_officers'],axis=1)
x.head(3)

,Pclass,Sex,Age,SibSp,Parch,title_Master,title_Miss,title_Mr,title_Mrs,title_Special
0,3,male,-0.611972,1,0,0,0,1,0,0
1,1,female,0.630431,1,0,0,0,0,1,0
2,3,female,-0.301371,0,0,0,1,0,0,0

In [16]:
x = x.join(pd.get_dummies(x.Parch, prefix ='Parch'))
x=x.drop(['Parch','Parch_0'],axis=1)
x.head(3)

,Pclass,Sex,Age,SibSp,title_Master,title_Miss,title_Mr,title_Mrs,title_Special,Parch_1,Parch_2,Parch_3,Parch_4,Parch_5,Parch_6,Parch_9
0,3,male,-0.611972,1,0,0,1,0,0,0,0,0,0,0,0,0
1,1,female,0.630431,1,0,0,0,1,0,0,0,0,0,0,0,0
2,3,female,-0.301371,0,0,1,0,0,0,0,0,0,0,0,0,0

In [17]:
x = x.join(pd.get_dummies(x.SibSp, prefix ='SibSp'))
x=x.drop(['SibSp','SibSp_0'],axis=1)
x.head(3)

,Pclass,Sex,Age,title_Master,title_Miss,title_Mr,title_Mrs,title_Special,Parch_1,Parch_2,...,Parch_4,Parch_5,Parch_6,Parch_9,SibSp_1,SibSp_2,SibSp_3,SibSp_4,SibSp_5,SibSp_8
0,3,male,-0.611972,0,0,1,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
1,1,female,0.630431,0,0,0,1,0,0,0,...,0,0,0,0,1,0,0,0,0,0
2,3,female,-0.301371,0,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [18]:
x = x.join(pd.get_dummies(x.Sex, prefix ='sex'))
x=x.drop(['Sex','sex_female'],axis=1)
x.head(3)

,Pclass,Age,title_Master,title_Miss,title_Mr,title_Mrs,title_Special,Parch_1,Parch_2,Parch_3,...,Parch_5,Parch_6,Parch_9,SibSp_1,SibSp_2,SibSp_3,SibSp_4,SibSp_5,SibSp_8,sex_male
0,3,-0.611972,0,0,1,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,1
1,1,0.630431,0,0,0,1,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0
2,3,-0.301371,0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [19]:
x = x.join(pd.get_dummies(x.Pclass, prefix ='pclass'))
x=x.drop(['Pclass','pclass_3'],axis=1)
x.head(3)

,Age,title_Master,title_Miss,title_Mr,title_Mrs,title_Special,Parch_1,Parch_2,Parch_3,Parch_4,...,Parch_9,SibSp_1,SibSp_2,SibSp_3,SibSp_4,SibSp_5,SibSp_8,sex_male,pclass_1,pclass_2
0,-0.611972,0,0,1,0,0,0,0,0,0,...,0,1,0,0,0,0,0,1,0,0
1,0.630431,0,0,0,1,0,0,0,0,0,...,0,1,0,0,0,0,0,0,1,0
2,-0.301371,0,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [20]:
print('Shape of X is: ',x.shape)

Shape of X is:  (1309, 22)

In [21]:
x_train = x.iloc[:891,:]
x_test = x.iloc[891:,:]

print(x_train.shape)
print()
print(x_test.shape)

(891, 22)

(418, 22)

In [22]:
y_train = df_train.Survived

In [23]:
y_train.shape

(891,)

In [24]:
import xgboost

In [25]:
from sklearn.model_selection import GridSearchCV

In [26]:
import numpy as np
learning_rate=np.logspace(-2,2,5)
gamma=np.logspace(-5,5,5)
booster=['gbtree','gblinear','dart']
objective=['binary:logistic','reg:squarederror']

In [27]:
xgb = xgboost.XGBClassifier(n_jobs=-1)

In [28]:
param_grid = dict(learning_rate=learning_rate,gamma=gamma,booster=booster,objective=objective)

In [29]:
grid = GridSearchCV(xgb,param_grid=param_grid,n_jobs=-1)

In [30]:
grid.fit(x_train,y_train)

GridSearchCV(cv='warn', error_score='raise-deprecating',
       estimator=XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
       colsample_bynode=1, colsample_bytree=1, gamma=0, learning_rate=0.1,
       max_delta_step=0, max_depth=3, min_child_weight=1, missing=None,
       n_estimators=100, n_jobs=-1, nthread=None,
       objective='binary:logistic', random_state=0, reg_alpha=0,
       reg_lambda=1, scale_pos_weight=1, seed=None, silent=None,
       subsample=1, verbosity=1),
       fit_params=None, iid='warn', n_jobs=-1,
       param_grid={'learning_rate': array([1.e-02, 1.e-01, 1.e+00, 1.e+01, 1.e+02]), 'gamma': array([1.00000e-05, 3.16228e-03, 1.00000e+00, 3.16228e+02, 1.00000e+05]), 'booster': ['gbtree', 'gblinear', 'dart'], 'objective': ['binary:logistic', 'reg:squarederror']},
       pre_dispatch='2*n_jobs', refit=True, return_train_score='warn',
       scoring=None, verbose=0)

In [31]:
pred_xgb=grid.predict(x_test)

In [32]:
print('Grid Search best parameter for xgb are : ',grid.best_params_)

Grid Search best parameter for xgb are :  {'booster': 'gbtree', 'gamma': 0.0031622776601683794, 'learning_rate': 0.1, 'objective': 'reg:squarederror'}

In [33]:
print(grid.best_score_)

0.8260381593714927

In [34]:
passengerId = df_test.PassengerId

In [35]:
# dataframe with predictions
predicted = pd.DataFrame({'PassengerId': passengerId, 'Survived': pred_xgb})
# save to csv
predicted.to_csv('titanic_pred.csv', index=False)